Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas

In [2]:
data = [4,8,15,16,23,42]

In [3]:
series = pandas.Series(data)

In [4]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
var = [1,2,3,4,5,6,7,8,9,10]

In [6]:
show = pandas.Series(var)

In [7]:
print(show)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
data = {"name" : ["Alice","Bob","Claire"],
         "age" : [25,30,27],
       "gender" : ["Female","Male","Female"]}

In [9]:
pandas.DataFrame(data)

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

data frame is a 2 dimensional labeled data structure that stores data in tabular form and it allows to store manipulate heterogeneous data types.
series is a one dimensional labeled data structure that store single data type.

In [10]:
data1 = {"name" : ["faizan","furkan","Grish","satish"],
         "education" : ["bsc physics","bsc zoology", "bsc chemistry", "bsc physics + medical coding"],
         "IQ" : [10, 9, 9.5, "10+"]
         }

In [22]:
dataa = pandas.DataFrame(data1)

In [23]:
dataa

     name                     education   IQ
0  faizan                   bsc physics   10
1  furkan                   bsc zoology    9
2   Grish                 bsc chemistry  9.5
3  satish  bsc physics + medical coding  10+

In [20]:
seris = [1,2,3,4]

In [21]:
pandas.Series(seris)

0    1
1    2
2    3
3    4
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [26]:
dataa.head(1) # to find top data line

     name    education  IQ
0  faizan  bsc physics  10

dataa.tail(1)   # to find last data line

In [29]:
dataa.columns

Index(['name', 'education', 'IQ'], dtype='object')

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

dataFrame

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [32]:
data1 = [1,2,3,4,5]
data2 = [1.2, 2.1, 3.2, 4.2, 5.2]

In [34]:
var = {"integers" : data1,
      "float" : data2}

In [35]:
pandas.DataFrame(var)

   integers  float
0         1    1.2
1         2    2.1
2         3    3.2
3         4    4.2
4         5    5.2